c5/src/ChartsOfCalculationTypes/Compensations/Compensations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Compensations</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Compensations</baseCalculationTypes>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Insurance</name>
    <type>
      <types>ChartOfCalculationTypesRef.Taxes</types>
    </type>
  </attributes>
  <attributes>
    <name>HourlyRate</name>
    <type>
      <types>EnumRef.HourlyRate</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.Calculations</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

c5/src/InformationRegisters/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Settings</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.Settings</types>
    </type>
  </resources>
  <dimensions>
    <name>Parameter</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Settings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/Calculations/Calculations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Calculations</name>
  <enumValues>
    <name>Absence</name>
  </enumValues>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Annual</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>ChildCare</name>
  </enumValues>
  <enumValues>
    <name>CompensationPercent</name>
  </enumValues>
  <enumValues>
    <name>DailyPercent</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>EveningHours</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>ExtraChildCare</name>
  </enumValues>
  <enumValues>
    <name>FixedAmount</name>
  </enumValues>
  <enumValues>
    <name>FixedIncomeTax</name>
  </enumValues>
  <enumValues>
    <name>HolidayHours</name>
  </enumValues>
  <enumValues>
    <name>HourlyRate</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsurance</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsuranceEmployee</name>
  </enumValues>
  <enumValues>
    <name>MonthlyRate</name>
  </enumValues>
  <enumValues>
    <name>NightHours</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>PaternityVacation</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>SickDays</name>
  </enumValues>
  <enumValues>
    <name>SickDaysChild</name>
  </enumValues>
  <enumValues>
    <name>SickOnlySocial</name>
  </enumValues>
  <enumValues>
    <name>SickProduction</name>
  </enumValues>
  <enumValues>
    <name>SocialInsurance</name>
  </enumValues>
  <enumValues>
    <name>SocialInsuranceEmployee</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>VacationWithoutPay</name>
  </enumValues>
</mdclass:Enum>

c5/src/ChartsOfCalculationTypes/Taxes/Taxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Taxes</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Taxes</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.Compensations</baseCalculationTypes>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.Calculations</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

c5/src/ChartsOfCalculationTypes/Compensations/Forms/Form/Module.bsl
&AtClient
var TableRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	fillTaxes ();
	
EndProcedure

&AtServer
Procedure fillTaxes ()
	
	s = "
	|select Taxes.Ref as Tax, case when Base.Ref is null then false else true end as Use
	|from ChartOfCalculationTypes.Taxes as Taxes
	|	//
	|	// Base
	|	//
	|	left join ChartOfCalculationTypes.Taxes.BaseCalculationTypes as Base
	|	on Base.Ref = Taxes.Ref
	|	and Base.CalculationType = &Ref
	|where not Taxes.DeletionMark
	|order by Taxes.Code
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Object.Ref );
	Taxes.Load ( q.Execute ().Unload () );

EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
		fillTaxes ();
	endif; 
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Base enable inlist ( Object.Method, Enum.Calculations.Percent, Enum.Calculations.Vacation, Enum.Calculations.SickDays, Enum.Calculations.SickProduction, Enum.Calculations.SickOnlySocial, Enum.Calculations.SickDaysChild, Enum.Calculations.ExtendedVacation );
	|HourlyRate show Object.Method = Enum.Calculations.MonthlyRate;
	|Insurance show inlist ( Object.Method, Enum.Calculations.SickDays, Enum.Calculations.SickProduction, Enum.Calculations.SickOnlySocial, Enum.Calculations.SickDaysChild );
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	if ( not Object.Method.IsEmpty () ) then
		PayrollItemForm.SetDescription ( Object );
	endif; 
	p = new Structure ( "Parameter", ChartsOfCharacteristicTypes.Settings.PayrollAccount );
	Object.Account = InformationRegisters.Settings.GetLast ( , p ).Value;
	
EndProcedure 

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	CurrentObject.AdditionalProperties.Insert ( "Taxes", Taxes );
	
EndProcedure

// *****************************************
// *********** Group Main

&AtClient
Procedure MethodOnChange ( Item )
	
	PayrollItemForm.MethodOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure DescriptionOnChange ( Item )
	
	PayrollItemForm.DescriptionOnChange ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Table Taxes

&AtClient
Procedure MarkAll ( Command )
	
	markTaxes ( true );
	
EndProcedure

&AtClient
Procedure markTaxes ( Flag )
	
	for each row in Taxes do
		row.Use = Flag;
		row.Dirty = true;
	enddo; 
	
EndProcedure 

&AtClient
Procedure UnmarkAll ( Command )
	
	markTaxes ( false );
	
EndProcedure

&AtClient
Procedure TaxesOnActivateRow ( Item )
	
	TableRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure TaxesSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	ShowValue ( , TableRow.Tax );
	
EndProcedure

&AtClient
Procedure TaxesBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure TaxesBeforeDeleteRow ( Item, Cancel )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure TaxesUseOnChange ( Item )
	
	TableRow.Dirty = true;
	
EndProcedure
